package com.pzj.modules.appapi.entity;

public enum CodeHandle {

    SUCCESS("10000", "成功"), //
    CODE_00000("00000", "未开通合作"), //
    FAILURE("ERROR", "错误代码**【99999】"), //

    ExistERROR("10001", "用户名不存在，请重新输入"), //
    LOGINERROR("10002", "用户名或密码错误"), //
    SERVERERROR("10003", "错误代码**【10003】"), //
    TOKENRERROR("10004", "token失效请登录"), //
    PASSWORDERROR("10005", "旧的密码不正确，请重新输入"), //
    UPDATEERROR("10006", "修改信息失败"), //
    UPLOADERROR("10007", "上传文件为空"), //
    SIGNERROR("10008", "验签失败"), //
    SCENEERROR("10009", "景区不存在"), //
    FILEERROR("10010", "文件上传失败"), //
    FILE10011("10011", "文件为空"), //
    ERROR10012("10012", "还未开通微店，请开通微店"), //
    ERROR10013("10013", "已绑定银行卡"), //
    ERROR10014("10014", "未绑定银行卡"), //
    ERROR10015("10015", "账号非法"), //
    ERROR10016("10016", "账号余额不足"), //
    ERROR10017("10017", "请输入正确的验证码"), //
    ERROR10018("10018", "此手机号的用户不存在"), //
    ERROR10019("10019", "支付密码不正确"), //
    ERROR10020("10020", "该用户已经注册"), //
    ERROR10021("10021", "该用户已经注册,等待审核"), //
    ERROR10022("10022", "审核拒绝，重新提交"), //
    ERROR10023("10023", "注册完成待审核 "), //
    ERROR10024("10024", "账号非导游、商户权限"), //
    ERROR10025("10025", "账号为商户权限（导游APP）"), //
    ERROR10026("10026", "账号为导游权限（商户APP）"), //
    ERROR10027("10027", "当前购买日期超过最后购买日期"), //
    ERROR10028("10028", "请输入正确的用户名"), //
    ERROR10029("10029", "审核被拒绝"), //
    ERROR10030("10030", "用户名不存在,请重新输入"), //
    ERROR10031("10031", "手机号不唯一"), //
    ERROR10032("10032", "图片上传失败"), //
    ERROR10033("10033", "参数不能为空"), //
    ERROR10038("10038", "计算默认购买日期出错"), //

    //订单错误
    ERROE_20000("20000", "此订单不存在"), // 
    ERROE_20001("20001", "此订单已存在"), //
    ERROE_20002("20002", "库存不足"), // 
    ERROE_20003("20003", "产品没有上架不能购买"), //
    ERROE_20004("20004", "当产品的类型为散票时，散票的总数量不能大于10"), // 
    ERROE_20005("20005", "你所要购买的产品没有正确的价格！，请联系景区!"), //
    ERROE_20006("20006", "订单信息有误!"), //
    ERROE_20007("20007", "查询库存出异常!"), //
    ERROE_20008("20008", "订单取消错误"), //
    ERROE_20009("20009", "订单不可定，时间错误"), //
    ERROE_20010("20010", "不能购买非凤凰的产品"), //
    ERROE_20011("20011", "价格错误，不能支付"), //
    ERROE_20012("20012", "演出已经开始，不能退票"), //
    ERROE_20013("20013", "分销商拒绝失败"), //
    ERROE_20014("20014", "分销商确认失败"), //
    ORDER_ERROE_20015("20015", "没有有效的渠道"), //
    ORDER_ERROE_20016("20016", "没有有效的产品类型"), //
    ORDER_ERROE_20017("20017", "创建voucher失败"), //
    ORDER_ERROE_20018("20018", "备注信息太多"), //
    ORDER_ERROE_20020("20020", "退款时缺少必要的参数"), //
    ORDER_ERROE_20021("20021", "当前时间已经无法退单"), //
    ORDER_ERROE_20022("20022", "退款的订单ID不能为空！"), //
    ORDER_ERROE_20023("20023", "没有有效的游玩开始时间"), //
    ORDER_ERROE_20024("20024", "时间无效，请检查时间"), //
    ORDER_ERROE_20025("20025", "订单ID无效"), //
    ORDER_ERROE_20026("20026", "当前订单不允许部分退商品，只能全退"), //
    ORDER_ERROE_20027("20027", "校验订单能否部分退错误"), //
    ORDER_ERROE_20028("20028", "当前时间不能购买所选定的商品"), //不符合购买时间
    ORDER_ERROE_20029("20029", "购买商品的数量不能小于最小购买数量！"), //不能小于最小购买数量
    ORDER_ERROE_20030("20030", "购买商品的数量不能大于最大购买数量！"), //不能小于最小购买数量
    ORDER_ERROE_20031("20031", "当前时间已经不能退该种商品！"), //不能小于最小购买数量
    ORDER_ERROE_20032("20032", "该商品不可退"), // 

    //查询错误
    //支付错误
    CODE_40001("40001", "没有查到订单信息"), //
    CODE_40002("40002", "产品已下线,支付失败!"), //
    CODE_40003("40003", "订单的状态不是未支付的!"), //
    CODE_40004("40004", "没有查到分销商的账户信息"), //
    CODE_40005("40005", "没有查到订单供应商的账户信息"), //
    CODE_40006("40006", "查询平台账户信息出错"), //
    CODE_40007("40007", "支付失败"), //
    CODE_40008("40008", "分销商账户余额不足"), //
    CODE_40010("40010", "订单已支付"), //

    CODE_30001("30001", "退款失败"), //
    CODE_30002("30002", "票已经过期，不允许退票"),

    /**
     * 发送短信
     */
    CODE_50001("50001", "重新发送短信成功"), //
    CODE_50002("50002", "重新发送短信失败"), //
    CODE_50003("50003", "操作频烦，请稍后再试"), //
    CODE_50004("50004", "该订单发送短信请求超过限制"), //
    /**
     * 是否有新版本
     * */
    CODE_70000("70000", "有新版本更新"), CODE_70001("70001", "无新版本更新"),
    //其他错误
    CODE_99999("99999", "错误代码**【99999】"), //
    CODE_90001("90001", "错误代码**【90001】"), //
    CODE_90002("90002", "错误代码**【90002】"), //
    CODE_90003("90003", "没有获取到数据"), //
    CODE_90004("90004", "此身份证号已购买此产品，在产品有效期内"), //
    CODE_90005("90005", "红包活动未到开始时间"), //
    CODE_90006("90006", "红包活动已过期"), //
    CODE_90007("90007", "使用红包数量大于购票人数"), //
    CODE_90008("90008", "此票已检不能修改票的信息"), //

    CODE_90010("90010", "剧场票没有座位"), //
    CODE_90011("90011", "该座位已被下单"), //
    CODE_90012("90012", "订单未选择座位信息"), //
    ERROR10034("10034", "验证一证一票出错"), //
    ERROR10035("10035", "此身份证在有效期内已有有效订单"), //
    ERROR10036("10036", "用户购买检票点冲突"), // 
    ERROR10037("10037", "自动派座出错"), ; //

    private String code;
    private String message;

    private CodeHandle(String code, String message) {
        this.code = code;
        this.message = message;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public static String getEnum(Integer code) {
        switch (code) {
            case 10000:
                return SUCCESS.message;
            case 99999:
                return CODE_99999.message;
            case 90001:
                return CODE_90001.message;
            case 2:
                return CODE_90002.message;
            case 3:
                return null;
        }
        return null;
    }

}
